let adder = (function () {
    let sum = 0;

    const add = (input) => {
        sum += input;
        return add;
    }

    add.toString = () => {
        return sum;
    }
    return add;
})();

// console.log(adder(1)(6)(-3).toString());
//adder(2) => няма да е функция , а ще е 2 и след това като направиш (3) ти вършиш следното 2(3), иначе , ако дадеш return func => пак ще се изпълни функцията
//и ще чака съответно пак функция, за да могат да се свършат следващите неща... (абе шантава история, но както и дае ). 
// дефакто вземаме функцията в addTo и след това понеже имаме () , тя веднага се изпълнява, а реално вътре е const add, и съответно

//addTo(2), обаче addTo == 2 и реално ще правиш 2(2), което ... е безсмислено, и за това трябва да върнем пак функция!

 // ако нямаш () , това ти играе ролята на присвояване и вече след това, ако имаш (5) , то го кара да изпълнява!
